In [1]:
import pandas as pd

In [38]:
d = {'tag3':[None, 'xxx', 'yyy', None], 'tag2':["aa", 'bb', 'cc', 'dd'], 'tag1':['aman', 'preet', 'singh', 'jassal'], 'text':[11, 22, 33, 44]}
d

{'tag3': [None, 'xxx', 'yyy', None],
 'tag2': ['aa', 'bb', 'cc', 'dd'],
 'tag1': ['aman', 'preet', 'singh', 'jassal'],
 'text': [11, 22, 33, 44]}

In [39]:
df = pd.DataFrame(d)
df

   tag3 tag2    tag1  text
0  None   aa    aman    11
1   xxx   bb   preet    22
2   yyy   cc   singh    33
3  None   dd  jassal    44

In [40]:
df = pd.get_dummies(df, columns=['tag1', 'tag2', 'tag3'], prefix=None)
df

,text,tag1_aman,tag1_jassal,tag1_preet,tag1_singh,tag2_aa,tag2_bb,tag2_cc,tag2_dd,tag3_xxx,tag3_yyy
0,11,1,0,0,0,1,0,0,0,0,0
1,22,0,0,1,0,0,1,0,0,1,0
2,33,0,0,0,1,0,0,1,0,0,1
3,44,0,1,0,0,0,0,0,1,0,0

In [53]:
cols = list(df.columns)
print(type(cols))
print(cols)

<class 'list'>
['text', 'tag1_aman', 'tag1_jassal', 'tag1_preet', 'tag1_singh', 'tag2_aa', 'tag2_bb', 'tag2_cc', 'tag2_dd', 'tag3_xxx', 'tag3_yyy']

In [54]:
new_col_list = []
for column in cols:
    if len(column.split("_")) == 2:
        new_col_list.append(column.split("_")[1])
    else:
        new_col_list.append(column)
print(new_col_list)

['text', 'aman', 'jassal', 'preet', 'singh', 'aa', 'bb', 'cc', 'dd', 'xxx', 'yyy']

In [55]:
df.columns = new_col_list
df

   text  aman  jassal  preet  singh  aa  bb  cc  dd  xxx  yyy
0    11     1       0      0      0   1   0   0   0    0    0
1    22     0       0      1      0   0   1   0   0    1    0
2    33     0       0      0      1   0   0   1   0    0    1
3    44     0       1      0      0   0   0   0   1    0    0